app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Nicky.Mouse"], ["body", "<p>Nicky.Mouse Nicky.Mouse Nicky.Mouse</p>"], ["user_id", 1], ["created_at", "2017-12-17 08:25:06.531082"], ["updated_at", "2017-12-17 08:25:06.531082"]]

  def update
    @post.update(post_params)
---
UPDATE "posts" SET "photo" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["photo", "4b979fe3d940f419_848x477.jpg"], ["updated_at", "2017-12-22 03:13:20.054336"], ["id", 7]]